[
  {
    "id": "period1",
    "name": "1990-2000",
    "startDate": "1990",
    "endDate": "2000",
    "events": [
      {
        "id": "event1",
        "title": "1991",
        "description": "В 1991 году был представлен первый веб-сайт, который стал основой для будущего интернета.В 1991 году был представлен первый веб-сайт, который стал основой для будущего интернета."
      },
      {
        "id": "event2",
        "title": "1994",
        "description": "В 1994 году был запущен первый коммерчески успешный браузер Netscape, что способствовало популяризации интернета."
      },
      {
        "id": "event3",
        "title": "1995",
        "description": "В 1995 году была основана компания Amazon, ставшая крупнейшим интернет-ритейлером в мире."
      },
      {
        "id": "event4",
        "title": "1997",
        "description": "В 1997 году был запущен сайт для обмена видео, который в дальнейшем стал YouTube."
      },
      {
        "id": "event5",
        "title": "1998",
        "description": "В 1998 году был основан Google, который в дальнейшем стал самым популярным поисковиком в мире."
      }
    ]
  },
  {
    "id": "period2",
    "name": "2000-2010",
    "startDate": "2000",
    "endDate": "2010",
    "events": [
      {
        "id": "event6",
        "title": "2001",
        "description": "В 2001 году был выпущен Windows XP, который стал одной из самых популярных операционных систем в истории."
      },
      {
        "id": "event7",
        "title": "2004",
        "description": "В 2004 году был основан Facebook, который стал одной из самых популярных социальных сетей в мире."
      },
      {
        "id": "event8",
        "title": "2007",
        "description": "В 2007 году Apple представила первый iPhone, революционизировавший мобильные технологии."
      },
      {
        "id": "event9",
        "title": "2008",
        "description": "В 2008 году был представлен Android, что привело к массовому распространению операционной системы для мобильных устройств."
      },
      {
        "id": "event10",
        "title": "2009",
        "description": "В 2009 году был запущен сервис для обмена фотографиями Instagram."
      }
    ]
  },
  {
    "id": "period3",
    "name": "2010-2020",
    "startDate": "2010",
    "endDate": "2020",
    "events": [
      {
        "id": "event11",
        "title": "2012",
        "description": "В 2012 году Tesla представила Model S, электромобиль, который стал символом нового подхода к экологичному транспорту."
      },
      {
        "id": "event12",
        "title": "2014",
        "description": "В 2014 году был выпущен первый коммерческий смартфон с технологией отпечатков пальцев."
      },
      {
        "id": "event13",
        "title": "2016",
        "description": "В 2016 году был представлен первый массовый продукт с технологией виртуальной реальности — Oculus Rift."
      },
      {
        "id": "event14",
        "title": "2018",
        "description": "В 2018 году было объявлено о запуске беспилотных автомобилей Tesla, что стало важной вехой в разработке автономного транспорта."
      },
      {
        "id": "event15",
        "title": "2019",
        "description": "В 2019 году был представлен iPhone 11, который стал первым смартфоном с тройной камерой и улучшенной производительностью."
      }
    ]
  },
  {
    "id": "period4",
    "name": "1980-1990",
    "startDate": "1980",
    "endDate": "1990",
    "events": [
      {
        "id": "event16",
        "title": "1981",
        "description": "В 1981 году был выпущен первый персональный компьютер IBM, что дало старт массовому распространению ПК."
      },
      {
        "id": "event17",
        "title": "1983",
        "description": "В 1983 году был запущен интернет-протокол TCP/IP, который стал основой для глобальной сети."
      },
      {
        "id": "event18",
        "title": "1984",
        "description": "В 1984 году был представлен первый Macintosh от Apple, который сделал персональные компьютеры доступными для широкого круга пользователей."
      },
      {
        "id": "event19",
        "title": "1989",
        "description": "В 1989 году был предложен первый концепт Всемирной паутины (World Wide Web) Тимом Бернерс-Ли."
      },
      {
        "id": "event20",
        "title": "1985",
        "description": "В 1985 году был запущен Microsoft Windows 1.0, который стал основой для всех будущих версий Windows."
      }
    ]
  },
  {
    "id": "period5",
    "name": "1990-2000",
    "startDate": "1990",
    "endDate": "2000",
    "events": [
      {
        "id": "event21",
        "title": "1995",
        "description": "В 1995 году был представлен первый веб-браузер Microsoft Internet Explorer, который стал массовым инструментом для пользования интернетом."
      },
      {
        "id": "event22",
        "title": "1997",
        "description": "В 1997 году был создан сайт для онлайн-магазинов eBay, который стал одним из первых мировых лидеров в сфере онлайн-торговли."
      },
      {
        "id": "event23",
        "title": "1998",
        "description": "В 1998 году был основан Google, который в дальнейшем стал самым популярным поисковиком в мире."
      },
      {
        "id": "event24",
        "title": "1999",
        "description": "В 1999 году был запущен сервис для обмена файлами Napster, который открыл новую эру в обмене музыкой и контентом."
      }
    ]
  },
  {
    "id": "period6",
    "name": "2000-2010",
    "startDate": "2000",
    "endDate": "2010",
    "events": [
      {
        "id": "event25",
        "title": "2004",
        "description": "В 2004 году был представлен Facebook, что значительно изменило способы общения и взаимодействия людей по всему миру."
      },
      {
        "id": "event26",
        "title": "2006",
        "description": "В 2006 году был запущен сервис YouTube, который стал ведущей платформой для обмена видео."
      },
      {
        "id": "event27",
        "title": "2007",
        "description": "В 2007 году был представлен первый iPhone, который стал одним из самых значимых технологических продуктов десятилетия."
      },
      {
        "id": "event28",
        "title": "2008",
        "description": "В 2008 году был представлен Android, что привело к массовому распространению операционной системы для мобильных устройств."
      },
      {
        "id": "event29",
        "title": "2009",
        "description": "В 2009 году был запущен сервис Twitter, который стал популярным способом для обмена короткими сообщениями в интернете."
      }
    ]
  }
]
